## Основные понятия

- **Система счисления** — способ записи чисел с помощью определённого набора цифр
- **Двоичная система** — система с основанием 2, цифры: 0, 1
- **Троичная система** — система с основанием 3, цифры: 0, 1, 2
- **Преобразование в k-ичную систему** — последовательное деление числа на основание системы
- **Преобразование из k-ичной системы** — вычисление значения по разрядам
## Алгоритм действий

### **Шаг 1: Анализируем условие**
Определяем, в какую систему счисления нужно преобразовать число:
- Если в двоичную — используем `bin()`
- Если в k-ичную (k ≠ 2) — пишем функцию преобразования
### **Шаг 2: Реализуем функцию преобразования**
Для троичной системы (аналогично для любой k-ичной):
```python
def to_base_k(n, k=3):
    result = ""
    while n > 0:
        result = str(n % k) + result
        n = n // k
    return result if result else "0"
```
### **Шаг 3: Пишем функцию алгоритма**
```python
# Для двоичной системы
def transform_binary(n):
    a = bin(n)[2:]
    # ... выполняем алгоритм из условия
    r = int(a, 2)
    return r

# Для троичной системы
def transform_ternary(n):
    a = to_base_k(n, 3)
    # ... выполняем алгоритм из условия
    r = int(a, 3)
    return r
```
### **Шаг 4: Организуем поиск**
```python
# Поиск минимального N, при котором R > value
for N in range(1, limit):
    R = transform(N)
    if R > value:
        print(N)
        break

# Поиск максимального N, при котором R > value
for N in range(limit-1, 0, -1):
    R = transform(N)
    if R > value:
        print(N)
        break

# Поиск минимального R > value
results = []
for N in range(1, limit):
    R = transform(N)
    if R > value:
        results.append(R)
print(min(results))

# Поиск максимального R в диапазоне N
results = []
for N in range(1, limit_N):
    R = transform(N)
    results.append(R)
print(max(results))
```
## Примеры решения

### **Задача 1: Двоичная система, поиск N**

**Задача:**  
На вход алгоритма подаётся натуральное число $N$. Алгоритм строит по нему новое число $R$ следующим образом:
1. Строится двоичная запись числа $N$.
2. К этой записи дописываются справа ещё два разряда по правилу:
   a) складываются все цифры двоичной записи, и остаток от деления суммы на 2 дописывается в конец числа;
   б) над этой записью производятся те же действия — справа дописывается остаток от деления суммы цифр на 2.
3. Результат переводится в десятичную систему.

*Пример:* для $12_{10} = 1100_2$ результат — $110000_2 = 48_{10}$.

Укажите такое **наименьшее** число $N$, для которого результат работы алгоритма больше числа 253.

**Решение:**
```python
def transform(n):
    a = bin(n)[2:]
    
    # Первое дописывание
    s = sum(int(bit) for bit in a)
    a += str(s % 2)
    
    # Второе дописывание
    s = sum(int(bit) for bit in a)
    a += str(s % 2)
    
    r = int(a, 2)
    return r

# Ищем наименьшее N, при котором R > 253
for i in range(1, 1000):
    r = transform(i)
    if r > 253:
        print(i)
        break
```

### **Задача 2: Двоичная система, поиск R**

**Задача:**  
На вход алгоритма подаётся натуральное число $N$. Алгоритм строит по нему новое число $R$ следующим образом:
1. Строится двоичная запись числа $N$.
2. Далее эта запись обрабатывается по правилу:
   a) если число чётное, то к двоичной записи числа слева дописывается 10;
   б) если число нечётное, то к двоичной записи числа слева дописывается 1 и справа дописывается 01.
3. Результат переводится в десятичную систему.

*Пример:* для $4_{10} = 100_2$ результат — $20_{10} = 10100_2$.

Укажите максимальное число $R$, которое может быть результатом работы данного алгоритма, при условии, что $N$ не больше 12.

**Решение:**
```python
def transform(n):
    a = bin(n)[2:]
    
    if n % 2 == 0:
        a = '10' + a
    else:
        a = '1' + a + '01'
    
    r = int(a, 2)
    return r

# Ищем максимальное R для N ≤ 12
results = []
for i in range(1, 13):
    r = transform(i)
    results.append(r)

print(max(results))
```

### **Задача 3: Троичная система, поиск R**

**Задача:**  
На вход алгоритма подаётся натуральное число $N$. Алгоритм строит по нему новое число $R$ следующим образом:
1. Строится троичная запись числа $N$.
2. Далее эта запись обрабатывается по правилу:
   a) если $N$ делится на 3, то к этой записи дописываются две последние троичные цифры;
   b) если $N$ на 3 не делится, то остаток от деления умножается на 5, переводится в троичную запись и дописывается в конец.
3. Результат переводится в десятичную систему.

*Пример:* для $11 = 102_3$ результат — $102101_3 = 307$, для $12 = 110_3$ результат — $11010_3 = 111$.

Укажите минимальное число $R$, большее 133, которое может быть получено с помощью описанного алгоритма.

**Решение:**
```python
def to_base_3(n):
    if n == 0:
        return "0"
    result = ""
    while n > 0:
        result = str(n % 3) + result
        n = n // 3
    return result

def transform(n):
    a = to_base_3(n)
    
    if n % 3 == 0:
        # Берём две последние цифры, если они есть
        if len(a) >= 2:
            a += a[-2:]
        else:
            a += a  # Если одна цифра, дублируем её
    else:
        remainder = (n % 3) * 5
        b = to_base_3(remainder)
        a += b
    
    r = int(a, 3)
    return r

# Ищем минимальное R > 133
results = []
for i in range(1, 1000):
    r = transform(i)
    if r > 133:
        results.append(r)

print(min(results))
```
## Полезные функции и приёмы

### **1. Сумма цифр числа в строковом представлении:**
```python
sum_digits = sum(int(digit) for digit in str_num)
```
### **2. Повторение символов:**
```python
# Каждую цифру повторяем 2 раза
doubled = ''.join(digit * 2 for digit in str_num)
```
### **3. Замена символов:**
```python
# Заменяем все '1' на '0'
replaced = str_num.replace('1', '0')
```
### **4. Подсчёт символов:**
```python
# Считаем количество '1' в строке
count_ones = str_num.count('1')
```
### **5. Обращение строки:**
```python
# Переворачиваем строку
reversed_str = str_num[::-1]
```
### **6. Добавление ведущих нулей:**
```python
# Дополняем строку до длины 8 нулями слева
padded = str_num.zfill(8)
```
## Типовой шаблон решения

```python
# 1. Функция преобразования в k-ичную систему
def to_base_k(n, k):
    if n == 0:
        return "0"
    result = ""
    while n > 0:
        result = str(n % k) + result
        n = n // k
    return result

# 2. Функция алгоритма преобразования
def transform(n):
    # Преобразуем в нужную систему
    if система == "двоичная":
        a = bin(n)[2:]
    else:
        a = to_base_k(n, основание)
    
    # Выполняем алгоритм из условия
    # ... (логика преобразования)
    
    # Преобразуем обратно в десятичную
    if система == "двоичная":
        r = int(a, 2)
    else:
        r = int(a, основание)
    
    return r

# 3. Организуем поиск по условию
if ищем_N:
    for i in range(начало, конец):
        r = transform(i)
        if условие_для_R:
            print(i)
            break
else:  # ищем_R
    results = []
    for i in range(начало, конец):
        r = transform(i)
        if условие_для_R:
            results.append(r)
    print(min(results) или max(results))
```

## Чек-лист решения

- [ ] Определил систему счисления из условия
- [ ] Написал функцию преобразования (если не двоичная)
- [ ] Реализовал алгоритм из условия задачи
- [ ] Определил, что ищем (N или R)
- [ ] Выбрал правильный диапазон перебора
- [ ] Правильно организовал поиск (минимальный/максимальный)
- [ ] Проверил на примерах из условия